//Задайте значение N. Напишите программу, которая выведет все натуральные числа в промежутке от N до 1. Выполнить с помощью рекурсии

// void WriteNum(int  N)
// {
//     if(N > 1)
//     {
//         Console.Write(N + " ");
//         WriteNum(N - 1);
//     }
//     if(N == 1)
//         Console.Write(N + " ");
// }

// int N = Convert.ToInt32(Console.ReadLine());
// WriteNum(N);

//Задайте значения M и N. Напишите программу, которая найдёт сумму натуральных элементов в промежутке от M до N

// void WriteNum(int  M , int N)
// {
//     if(M < N)
//     {
//         Console.Write(M + " ");
//         WriteNum(M + 1, N);
//     }
//     if(M > N)
//     {
//         Console.Write(M + " ");
//         WriteNum(M - 1, N);
//     }
//     if(M == N)
//         Console.Write(M + " ");
// }

// int M = Convert.ToInt32(Console.ReadLine());
// int N = Convert.ToInt32(Console.ReadLine());
// WriteNum(M,N);
